"""
2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
   имя, фамилия, год рождения, город проживания, email, телефон.
   Функция должна принимать параметры как именованные аргументы. Реализовать вывод данных о пользователе одной строкой.
"""
print("= " *50)
print("{greeting:^100}".format(greeting="Добро пожаловать на страницу перевода время в часы, минуты и секунды!"))
print("= " *50)

