"""
1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
   Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
"""
print("= " *50)
print("{greeting:^100}".format(greeting="Добро пожаловать на страницу опросника!"))
print("= " *50)

