"""
3. Реализовать функцию my_func(), которая принимает три позиционных аргумента,
   и возвращает сумму наибольших двух аргументов.
"""
print("= " *50)
print("{greeting:^100}".format(greeting="Добро пожаловать на страницу 'Расчитай число'"))
print("= " *50)
